#LEXICON_RU = {'yes': '✅ ДА!', 'no': '❌ НЕТ', 'cancel': 'Отменить'}

LEXICON = {
    "forward": ">>",
    "backward": "<<",
    "/start": "<b>Привет, читатель!</b>\n\nВ боте представлена "
              'книга Иммануила Канта\n"КРИТИКА ЧИСТОГО '
              'РАЗУМА", 1867г.\nперевод М. Владиславлева\n\nВ тексте написание некоторых слов отличается от современного, что соответствуют времени перевода.\nПрисутствуют буквы: i-[и], θ-[ф], ѣ-[е], ъ-твердый знак в конце слов (в русском языке использовались до 1918)'
              '\nПримечания автора и переводчика:\n{..} - сразу после поясняемого текста\n{*} - указатель на примечание приведенное ниже'
              '\n\nЧтобы посмотреть список доступных команд - набери /help',
    "/help": "<b>Это бот-читалка</b>\n\nДоступные команды:\n\n/beginning - "
             "перейти в начало книги\n/continue - продолжить чтение\n/contents - содержание "
             "книги\n/bookmarks - посмотреть список закладок\n/help - "
             "справка по работе бота\n\nЧтобы сохранить закладку - "
             "нажмите на кнопку с номером страницы\n\n<b>Приятного чтения!</b>",
    "/contents": "<b>СОДЕРЖАНИЕ</b>\n\n"
             "ПРЕДИСЛОВІЕ ПЕРЕВОДЧИКА\n\nПосвященіе\nПредисловіе къ первому изданію\nПредисловіе ко второму изданію\n\n\n"
             "<b>ВВЕДЕНІЕ.</b>\n\n"
             "I. Различіе чистаго и опытнаго познанія\n"
             "II. Мы имѣемъ нѣкоторыя познанія а priori и даже обыкновенный разсудокъ не лишенъ ихъ\n"
             "III. Для философіи необходима наука, опредѣляющая возможность, принципы и объемъ всѣхъ познаній а priori\n"
             "IV. Различіе аналитическихъ и синтетическихъ сужденій\n"
             "V. Синтетическія сужденія а priori содержатся во всѣхъ теоретическихъ наукахъ разума въ качествѣ принциповъ\n"
             "VI. Общая задача чистаго разума\n"
             "VII. Идея и раздѣленіе на подъ названіемъ критики чистаго разума\n\n\n"
             "<b>ТРАНСЦЕНДЕНТАЛЬНОЕ ОБЩЕЕ УЧЕНІЕ</b>\n\n"
             "<b>ПЕРВАЯ ЧАСТЬ.</b> Трансцендентальная-эстетика\n\n"
             "ПЕРВЫЙ ОТДѢЛЪ. О пространствѣ\n"
             "ВТОРОЙ ОТДѢЛЪ. О времени\n\n\n"
             "<b>ВТОРАЯ ЧАСТЬ.</b> Трансцендентальная логика\n\n"
             "Введеніе. Идея трансцендентальной логики\n"
             "  I. О логикѣ вообще\n"
             "  II. О трансцендентальной логикѣ\n"
             "  III. Раздѣленіе общей логики на аналитику и діалектику\n"
             "  IV. Раздѣленіе трансцендентальной логики на трансцендентальную аналитику и діалектику\n\n\n"
             "<b>Первое отдѣленіе.</b> Трансцендентальная аналитика\n\n"
             "<b>Первая книга.</b> Аналитика понятій\n"
             "Отдѣлъ I. Путеводная нить къ открытію всѣхъ чистыхъ понятій разсудка\n"
             "  Глава 1. Логическое употребленіе разсудка вообще\n"
             "  Глава 2. Логическія дѣятельности разсудка въ сужденіяхъ\n"
             "  Глава 3. Чистыя понятія разсудка или категоріи\n\n"
             "Отдѣлъ II. Выводъ чистыхъ понятій разсудка\n"
             "  Глава 1. Принципы трансцендентальнаго вывода вообще\n"
             "  Глава 2. Трансцендентальный выводъ чистыхъ понятій разсудка\n\n"
             "<b>Вторая книга.</b> Аналитика основоположеній\n"
             "Введеніе. О трансцендентальной способности сужденія вообще\n"
             "Отдѣлъ I. О схематизмѣ чистыхъ понятій разсудка\n\n"
             "Отдѣлъ II. Система всѣхъ основоположеній чистаго разсудка\n"
             "  Глава 1. Высшее основоположеніе всѣхъ аналитическихъ сужденій\n"
             "  Глава 2. Высшее основоположеніе всѣхъ синтетическихъ сужденій\n"
             "  Глава 3. Систематическое изложеніе всѣхъ синтетическихъ основоположеній чистаго разсудка\n"
             "    1. Аксіомы представленія\n"
             "    2. Предвареніе воспріятія\n"
             "    3. Аналогіи опыта\n"
             "       А. Основоположеніе постоянства субстанціи\n"
             "       B. Основоположеніе временной послѣдовательности по закону причинности\n"
             "       C. Основоположеніе одновременнаго бытія, по закону взаимодѣйствія или общенія\n"
             "    4. Постуляты опытнаго мышленія вообще\n\n"
             "Отдѣлъ III. Основаніе различенія всѣхъ предметовъ вообще на phaenomena и noumena\n\n\n"
             "<b>Второе отдѣленіе.</b> Трансцендентальная діалектика.\n\n"
             "Введеніе.\n"
             "  I. О трансцендентальной видимости\n"
             "  II. О чистомъ разумѣ, какъ источникѣ трансцендентальной видимости\n"
             "      А. О разумѣ вообще\n"
             "      В. О логическомъ употребленіи разума\n"
             "      С. О чистомъ употребленіи разума\n\n"
             "<b>ПЕРВАЯ КНИГА.</b> О понятіяхъ чистаго разума\n"
             "  Глава 1. Объ идеяхъ вообще\n"
             "  Глава 2. О трансцендентальныхъ идеяхъ\n"
             "  Глава 3. Система трансцендентальныхъ идей\n\n"
             "<b>ВТОРАЯ КНИГА.</b> О діалектическихъ умозаключеніяхъ чистаго разума\n"
             "Отдѣлъ I. О ложныхъ умозаключеніяхъ чистаго разума\n\n"
             "Отдѣлъ II. Объ антиноміи чистаго разума\n"
             "  Глава 1. Система космологическихъ идей\n"
             "  Глава 2. Ученіе объ антиноміяхъ чистаго разума\n"
             "  Глава 3. Интересъ разума при упомянутыхъ противорѣчіяхъ\n"
             "  Глава 4. О возможности разрѣшенія трансцендентальныхъ задачъ чистаго разума\n"
             "  Глава 5. Скептическое изложеніе космологическихъ вопросовъ по всѣмъ четыремъ трансцендентальнымъ идеямъ\n"
             "  Глава 6. Трансцендентальный идеализмъ, какъ ключъ къ разрѣшенію космологической діалектики\n"
             "  Глава 7. Критическое рѣшеніе космологическаго противорѣчія разума самому себѣ\n"
             "  Глава 8. Руководительное начало чистаго разума относительно космологическихъ идей\n"
             "  Глава 9. Опытное употребленіе руководительнаго начала въ приложеніи ко всѣмъ космологическимъ идеямъ\n\n"
             "Отдѣлъ III. Идеалъ чистаго разума.\n"
             "  Глава 1. Объ идеалѣ вообще\n"
             "  Глава 2. О трансцендентальномъ идеалѣ\n"
             "  Глава 3. О доказательствахъ теоретическаго разума въ пользу бытія Высшаго Существа\n"
             "  Глава 4. О невозможности онтологическаго доказательства бытія Божія\n"
             "  Глава 5. Невозможность космологическаго доказательства бытія Божія\n"
             "  Глава 6. Невозможность физико-теологическаго доказательства\n"
             "  Глава 7. Критика всякаго Богословія\n\n\n"
             "<b>Часть вторая.</b> Трансцендентальное ученіе о методѣ\n\n"
             "Отдѣлъ I. Руководство чистаго разума\n"
             "  Глава 1. Руководство чистаго разума при догматическомъ употребленіи\n"
             "  Глава 2. Руководство чистаго разума въ его полемической дѣятельности\n"
             "  Глава 3. Руководство чистаго разума относительно предположеній (гипотезъ)\n"
             "  Глава 4. Руководство чистаго разума относительно доказательствъ\n\n"
             "Отдѣлъ II. Правило (Kanon) чистаго разума\n"
             "  Глава 1. Послѣдняя цѣль чистаго употребленія нашего разума\n"
             "  Глава 2. Идеалъ высшаго блага, какъ опредѣляющее основаніе послѣдней цѣли чистаго разума\n"
             "  Глава 3. Мнѣніе, знаніе, вѣра\n\n"
             "Отдѣлъ III. Наука о построеніяхъ чистаго разума\n\n"
             "Отдѣлъ IV. Исторія чистаго разума\n",
    "/bookmarks": "<b>Это список ваших закладок:</b>",
    "Start_reading": "📘 Начать чтение",
    "Сontinue_reading": "📖 Продолжить чтение",
    "edit_bookmarks": "<b>Редактировать закладки</b>",
    "edit_bookmarks_button": "❌ РЕДАКТИРОВАТЬ",
    "del": "❌",
    "cancel": "ОТМЕНИТЬ",
    "no_bookmarks": "У вас пока нет ни одной закладки.\n\nЧтобы "
                    "добавить страницу в закладки - во время чтения "
                    "книги нажмите на кнопку с номером этой "
                    "страницы\n\n/continue - продолжить чтение",
    "cancel_text": "/continue - продолжить чтение",
    "other_answer": "Извини, это сообщение не обрабатывается.\n\nВопросы и пожелания можешь отправить в личку - @borolty",
}


LEXICON_COMMANDS = {
    "/beginning": "В начало книги (текущая страница перезапишется на стр.1)",
    "/continue": "Продолжить чтение",
    "/bookmarks": "Мои закладки",
    "/help": "Справка по работе бота",
}



#LEXICON_RU = {
#    "/start": "<b>Привет!</b> 👋\n\nДавай с тобой сыграем в игру "
#              '"Камень, ножницы, бумага"?\n\nЕсли ты, вдруг, '
#              "забыл правила, команда /help тебе поможет!\n\n<b>Играем?</b>",
#    "/help": "Это очень простая игра. Мы одновременно должны "
#             "сделать выбор одного из трех предметов. Камень 🗿, "
#             "ножницы ✂️ или бумага 📜.\n\nЕсли наш выбор "
#             "совпадает - ничья, а в остальных случаях камень "
#             "побеждает (ломает) ножницы, ножницы побеждают (разрезают) бумагу, "
#             "а бумага побеждает (накрывает) камень.\n\n<b>Играем?</b>",
#    "rock": "Камень 🗿",
#    "paper": "Бумага 📜",
#    "scissors": "Ножницы ✂️",
#    "yes_button": "✅ Давай!",
#    "no_button": "Не хочу!",
#    "other_answer": "Извини, увы, это сообщение мне непонятно...",
#    "yes": "Отлично! Делай свой выбор!",
#    "no": "😥 Жаль...\n\nЕсли захочешь сыграть, просто разверни "
#          'клавиатуру и нажми кнопку "✅ Давай!"',
#    "bot_won": "Я победил!\n\nСыграем еще?",
#    "user_won": "Ты победил! Поздравляю!\n\nДавай сыграем еще?",
#    "nobody_won": "Ничья!\n\nПродолжим?",
#    "bot_choice": "Мой выбор",}

#LEXICON_RU: dict[str, str] = {
 #   '/start': 'Привет!\n\nЯ эхо-бот для демонстрации работы роутеров!\n\n'
 #             'Если хотите - можете мне что-нибудь прислать или '
 #             'отправить команду /help',
 #   '/help': 'Я просто отправляю вам копию вашего сообщения',
 #   'no_echo': 'Данный тип апдейтов не поддерживается '
 #              'методом send_copy'}

#   '/start': 'Привет!\nВы запускаете процессс познания своего мира!\n\n'
           #  'Чтобы получить правила познания и список доступных '
           #  'действий - отправьте команду /help'
#   '/help':  f'Правила:\n\nЯ описываю вам ситуацию, '
#             f'вам нужно выбрать вариант ответа. \nВсего вопросов {ATTEMPTS} \n'
             #f'Выбирайте тот вариант, который наиболее вам свойственен\n\n
             # Доступные команды:\n/help - правила\n'
             #f'/continue - продолжить\n\nНачнем?'
